In [6]:
people = {
    "first": ["Mallikharjun"],
    "last": ["Namagiri"],
    "email": ["mallik.namagiri@gmail.com"]
}

In [15]:
people = {
    'first': ['Mallikharjun', 'Peter', 'Srini'],
    'last': ['Namagiri', 'Kata', 'Kata'],
    'email': ['mallik.namagiri@gmail.com', 'peter.kata@gmail.com', 'srini.kata@gmail.com']
}

In [8]:
import pandas as pd

In [16]:
df = pd.DataFrame(people)

In [17]:
df

                       email         first      last
0  mallik.namagiri@gmail.com  Mallikharjun  Namagiri
1       peter.kata@gmail.com         Peter      Kata
2       srini.kata@gmail.com         Srini      Kata

In [19]:
df['first'] + ' ' + df['last']

0    Mallikharjun Namagiri
1               Peter Kata
2               Srini Kata
dtype: object

In [20]:
# Adding columns
df['full_name'] = df['first'] + ' ' + df['last']
df

                       email         first      last              full_name
0  mallik.namagiri@gmail.com  Mallikharjun  Namagiri  Mallikharjun Namagiri
1       peter.kata@gmail.com         Peter      Kata             Peter Kata
2       srini.kata@gmail.com         Srini      Kata             Srini Kata

In [23]:
# Remove columns
df.drop(columns=['first', 'last'], inplace=True)

In [24]:
df

                       email              full_name
0  mallik.namagiri@gmail.com  Mallikharjun Namagiri
1       peter.kata@gmail.com             Peter Kata
2       srini.kata@gmail.com             Srini Kata

In [25]:
df['full_name'].str.split(' ')

0    [Mallikharjun, Namagiri]
1               [Peter, Kata]
2               [Srini, Kata]
Name: full_name, dtype: object

In [26]:
df['full_name'].str.split(' ', expand= True)

              0         1
0  Mallikharjun  Namagiri
1         Peter      Kata
2         Srini      Kata

In [28]:
df[['first', 'last']] = df['full_name'].str.split(' ', expand= True)

In [29]:
df

                       email              full_name         first      last
0  mallik.namagiri@gmail.com  Mallikharjun Namagiri  Mallikharjun  Namagiri
1       peter.kata@gmail.com             Peter Kata         Peter      Kata
2       srini.kata@gmail.com             Srini Kata         Srini      Kata

In [31]:
df.append({'first': 'sai'}, ignore_index=True)

                       email              full_name         first      last
0  mallik.namagiri@gmail.com  Mallikharjun Namagiri  Mallikharjun  Namagiri
1       peter.kata@gmail.com             Peter Kata         Peter      Kata
2       srini.kata@gmail.com             Srini Kata         Srini      Kata
3                        NaN                    NaN           sai       NaN

In [38]:
people2 = {
    'first': ['Sai', 'lalli'],
    'last': ['ch', 'hr'],
    'email': ['sai.ch@gmil.com', 'lalli.hr@gmail.com']
}

In [39]:
df2 = pd.DataFrame(people2)
df2

                email  first last
0     sai.ch@gmil.com    Sai   ch
1  lalli.hr@gmail.com  lalli   hr

In [43]:
df.append(df2, ignore_index=True)

                       email         first              full_name      last
0  mallik.namagiri@gmail.com  Mallikharjun  Mallikharjun Namagiri  Namagiri
1       peter.kata@gmail.com         Peter             Peter Kata      Kata
2       srini.kata@gmail.com         Srini             Srini Kata      Kata
3            sai.ch@gmil.com           Sai                    NaN        ch
4         lalli.hr@gmail.com         lalli                    NaN        hr

In [49]:
df = df.append(df2, ignore_index=True)
df

                       email         first              full_name      last
0  mallik.namagiri@gmail.com  Mallikharjun  Mallikharjun Namagiri  Namagiri
1       peter.kata@gmail.com         Peter             Peter Kata      Kata
2       srini.kata@gmail.com         Srini             Srini Kata      Kata
3            sai.ch@gmil.com           Sai                    NaN        ch
4         lalli.hr@gmail.com         lalli                    NaN        hr
5            sai.ch@gmil.com           Sai                    NaN        ch
6         lalli.hr@gmail.com         lalli                    NaN        hr

In [46]:
# drop the row
df.drop(index=4)

                       email         first              full_name      last
0  mallik.namagiri@gmail.com  Mallikharjun  Mallikharjun Namagiri  Namagiri
1       peter.kata@gmail.com         Peter             Peter Kata      Kata
2       srini.kata@gmail.com         Srini             Srini Kata      Kata
3            sai.ch@gmil.com           Sai                    NaN        ch

In [48]:
df.drop(index=df[df['last'] == 'Kata'].index)

                       email         first              full_name      last
0  mallik.namagiri@gmail.com  Mallikharjun  Mallikharjun Namagiri  Namagiri
3            sai.ch@gmil.com           Sai                    NaN        ch
4         lalli.hr@gmail.com         lalli                    NaN        hr

In [53]:
filt = (df['last'] == 'Kata')
df.drop(index=df[filt].index)

                       email         first              full_name      last
0  mallik.namagiri@gmail.com  Mallikharjun  Mallikharjun Namagiri  Namagiri
3            sai.ch@gmil.com           Sai                    NaN        ch
4         lalli.hr@gmail.com         lalli                    NaN        hr
5            sai.ch@gmil.com           Sai                    NaN        ch
6         lalli.hr@gmail.com         lalli                    NaN        hr